<h1><center>DS200 - PE1: Pandas Exercises</center></h1>

### Introduction:

In this exercise, you will be wrangling with the given dataset with Pandas tools. The dataset is a subset of [US Baby Names Dataset](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle. In the dataset, you can find US baby names from 2004 until 2014. 

Take about 20 - 25 min working in a group to find the solutions for Q1 - Q10. Then brainstorm your ideas with the whole class for the rest of the time. 

Note this exercise very well resembles the question formats and difficulty level in a lab and exam. So please take it as a checkup on your understanding to the course contents. 


### Import the necessary libraries

In [1]:
import numpy as np
import pandas as pd

### Q1: Given the dataset from this [URL](https://github.com/BlueJayADAL/DS200/blob/master/datasets/US_Baby_Names.csv?raw=true).

In [2]:
url = 'https://github.com/BlueJayADAL/DS200/blob/master/datasets/US_Baby_Names.csv?raw=true'

### Read in the dataset into a DataFrame called `baby_names`.

In [3]:
baby_names = pd.read_csv(url)

### Q2: Show the top 10 rows of the DataFrame

In [4]:
baby_names.head(n=10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Show the basic information of the DataFrame as below.

In [5]:
baby_names.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1016395 entries, 0 to 1016394
Data columns (total 7 columns):
 #   Column      Non-Null Count    Dtype
---  ------      --------------    -----
 0   Unnamed: 0  1016395 non-null  int64
 1   Id          1016395 non-null  int64
 2   Name        1016395 non-null  object
 3   Year        1016395 non-null  int64
 4   Gender      1016395 non-null  object
 5   State       1016395 non-null  object
 6   Count       1016395 non-null  int64
dtypes: int64(4), object(3)
memory usage: 54.3+ MB

### Show the basic statistics for all columns from the DataFrame

In [6]:
baby_names.describe()

         Unnamed: 0            Id          Year         Count
count  1.016395e+06  1.016395e+06  1.016395e+06  1.016395e+06
mean   2.830990e+06  2.830991e+06  2.009053e+03  3.485012e+01
std    1.652476e+06  1.652476e+06  3.138293e+00  9.739735e+01
min    1.134900e+04  1.135000e+04  2.004000e+03  5.000000e+00
25%    1.317326e+06  1.317328e+06  2.006000e+03  7.000000e+00
50%    2.811920e+06  2.811921e+06  2.009000e+03  1.100000e+01
75%    4.242554e+06  4.242556e+06  2.012000e+03  2.600000e+01
max    5.647425e+06  5.647426e+06  2.014000e+03  4.167000e+03

### Q3: Show the number of missing values for each column.

In [7]:
baby_names.isnull().sum()

Unnamed: 0    0
Id            0
Name          0
Year          0
Gender        0
State         0
Count         0
dtype: int64

### Delete the column `Unnamed: 0`, as it is essentially the same as column `Id`. Ensure the change is in place.

In [12]:
# delete 'Unnamed: 0' column
baby_names.drop(labels = 'Unnamed: 0', axis = 1, inplace = True)

In [13]:
# Verify if that column is gone. 
baby_names.head()

      Id     Name  Year Gender State  Count
0  11350     Emma  2004      F    AK     62
1  11351  Madison  2004      F    AK     48
2  11352   Hannah  2004      F    AK     46
3  11353    Grace  2004      F    AK     44
4  11354    Emily  2004      F    AK     41

### Q4. Checkout the total number of occurrences for male and female names in the dataset.

In [14]:
baby_names['Gender'].value_counts()

F    558846
M    457549
Name: Gender, dtype: int64

### Find out what are the unique years in the DataFrame.

In [15]:
baby_names['Year'].unique()

array([2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2014],
      dtype=int64)

### How many different names are there in the DataFrame?

In [16]:
baby_names['Name'].nunique()

17632

### Q5: Convert the `Year` column from `str` type to `datatime` type using Pandas `to_datetime()` function.

In [17]:
baby_names['Year'] = pd.to_datetime(baby_names['Year'], format='%Y')



# Display the data types of the Year column
baby_names.dtypes

Id                 int64
Name              object
Year      datetime64[ns]
Gender            object
State             object
Count              int64
dtype: object

### Then set the `Year` column as the index to the DataFrame. Ensure the change is in place.

In [18]:
baby_names.set_index('Year', inplace = True)


# Display the top five rows.
baby_names.head()

               Id     Name Gender State  Count
Year
2004-01-01  11350     Emma      F    AK     62
2004-01-01  11351  Madison      F    AK     48
2004-01-01  11352   Hannah      F    AK     46
2004-01-01  11353    Grace      F    AK     44
2004-01-01  11354    Emily      F    AK     41

### Q6: Grab all the data records out from the year of 2010.

In [25]:
baby_names.sort_index(axis = 0, inplace = True)

In [26]:
baby_names['2010']

C:\Users\augus\AppData\Local\Temp/ipykernel_17184/1053402649.py:1: FutureWarning: Indexing a DataFrame with a datetimelike index using a single string to slice the rows, like `frame[string]`, is deprecated and will be removed in a future version. Use `frame.loc[string]` instead.
  baby_names['2010']

                 Id      Name Gender State  Count
Year
2010-01-01  5066439   Zadrian      M    TX      6
2010-01-01  5066491     Calob      M    TX      5
2010-01-01  5065055    Westin      M    TX     24
2010-01-01  5065054    Tyrone      M    TX     24
2010-01-01  5065053   Stetson      M    TX     24
...             ...       ...    ...   ...    ...
2010-01-01  1493509  Katelynn      F    ID      7
2010-01-01  1493510    Leslie      F    ID      7
2010-01-01  1493511     Lexie      F    ID      7
2010-01-01  2011570     Dylan      F    KY      5
2010-01-01  1493532       Ali      F    ID      6

[93307 rows x 5 columns]

### Get the total `Count` of baby names for each year.

In [33]:
baby_names['Count'].resample('Y').sum()

Year
2004-12-31    3293984
2005-12-31    3305315
2006-12-31    3387737
2007-12-31    3412417
2008-12-31    3340318
2009-12-31    3232116
2010-12-31    3116548
2011-12-31    3079145
2012-12-31    3073858
2013-12-31    3066443
2014-12-31    3113611
Freq: A-DEC, Name: Count, dtype: int64

### Get the total Count of baby names for every two years.

In [35]:
baby_names['Count'].resample('2Y').sum()

Year
2004-12-31    3293984
2006-12-31    6693052
2008-12-31    6752735
2010-12-31    6348664
2012-12-31    6153003
2014-12-31    6180054
Freq: 2A-DEC, Name: Count, dtype: int64

###  Q7. Checkout the top 5 most used names of all time, in descending order.

Hint: consider using a combination of `groupby` and `sort_values` functions. Both DataFrame or Series output formats are acceptable.

In [47]:
baby_names.groupby(by='Name')['Count'].sum().sort_values(ascending=False).head()

Name
Jacob       242874
Emma        214852
Michael     214405
Ethan       209277
Isabella    204798
Name: Count, dtype: int64

### Q8. Find the least used names during 2010-2014.

In [62]:
baby_names['2010':'2014'].groupby(by='Name').sum()['Count'].idxmin()

'Aadan'

### Q9. Which state in the year of 2008 had the most baby girls?

In [70]:
baby_2008 = baby_names['2008']
baby_2008[baby_2008['Gender'] == 'F'].groupby('State').sum()['Count'].idxmax()

C:\Users\augus\AppData\Local\Temp/ipykernel_17184/3631057202.py:1: FutureWarning: Indexing a DataFrame with a datetimelike index using a single string to slice the rows, like `frame[string]`, is deprecated and will be removed in a future version. Use `frame.loc[string]` instead.
  baby_2008 = baby_names['2008']

'CA'

### Q10: In the `Gender` column, change all `M` into `Male`, and `F` into `Female`.

In [22]:
#design function to return male or female
baby_names['Gender'] = 



baby_names.head()

                 Id    Name  Gender State  Count
Year
2004-01-01    11350    Emma  Female    AK     62
2004-01-01  4742893  Harold    Male    TN     14
2004-01-01  4742894   Issac    Male    TN     14
2004-01-01  4742895  Jayson    Male    TN     14
2004-01-01  4742896   Josue    Male    TN     14

## Great Job!